In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [2]:
%%sql
SELECT *
    FROM invoice_line
    LIMIT 2

 * sqlite:///chinook.db
Done.

[(1, 1, 1158, 0.99, 1), (2, 1, 1159, 0.99, 1)]

In [3]:
%%sql
SELECT name
    FROM sqlite_master
    WHERE type IN ('table')

 * sqlite:///chinook.db
Done.

[('album',),
 ('artist',),
 ('customer',),
 ('employee',),
 ('genre',),
 ('invoice',),
 ('invoice_line',),
 ('media_type',),
 ('playlist',),
 ('playlist_track',),
 ('track',)]

In [ ]:
%%sql
SELECT *
    FROM invoice_line
    LIMIT 2

In [ ]:
%%sql
SELECT *
    FROM track
    LIMIT 2

In [ ]:
%%sql
SELECT * FROM media_type LIMIT 2

In [ ]:
%%sql
SELECT COUNT(*) FROM invoice_line

In [ ]:
%%sql
SELeCT * FROM invoice_line WHERE invoice_id = 3

In [ ]:
%%sql
SELECT * FROM invoice_line il
INNER JOIN track t ON t.track_id = il.track_id
WHERE invoice_id = 3

In [ ]:
%%sql
SELECT *
    FROM invoice_line il
    INNER JOIN track t ON t.track_id = il.track_id
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    WHERE invoice_id = 3

In [ ]:
%%sql
SELECT il.track_id, t.name AS track_name, at.name AS artist_name, mt.name AS track_type, il.unit_price, il.quantity
    FROM invoice_line il
    INNER JOIN track t ON t.track_id = il.track_id
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    INNER JOIN album ab ON ab.album_id = t.album_id
    INNER JOIN artist at ON at.artist_id = ab.artist_id
    WHERE il.invoice_id = 4

In [ ]:
%%sql
SELECT t.track_id, ar.name artist_name
    FROM track t
    INNER JOIN album al on al.album_id = t.album_id
    INNER JOIN artist ar ON ar.artist_id = al.artist_id
    ORDER BY 1
    LIMIT 5

In [ ]:
%%sql
SELECT il.invoice_line_id, il.track_id, ta.artist_name
    FROM invoice_line il
    INNER JOIN (
                SELECT t.track_id, ar.name artist_name
                FROM track t
                INNER JOIN album al ON al.album_id = t.album_id
                INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    ORDER BY 1
    LIMIT 5

In [ ]:
%%sql
SELECT ta.artist_name, COUNT(*) tracks_purchased
    FROM invoice_line il
    INNER JOIN (
                SELECT t.track_id, ar.name artist_name
                FROM track t
                INNER JOIN album al ON al.album_id = t.album_id
                INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    GROUP BY 1
    ORDER BY 2 DESC 
    
    LIMIT 10

In [ ]:
%%sql
SELECT ta.album, ta.artist, SUM(il.quantity) AS tracks_purchased
    FROM invoice_line il
    INNER JOIN (SELECT t.track_id,al.title AS album, ar.name AS artist
               FROM track t
               INNER JOIN album al ON al.album_id = t.album_id
               INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    GROUP BY 1
    ORDER BY 3 DESC
    LIMIT 5

In [ ]:
%%sql
SELECT e1.employee_id, e2.employee_id supervisor_id
    FROM employee e1
    INNER JOIN employee e2 ON e1.reports_to = e2.employee_id
    LIMIT 4;

In [ ]:
%%sql
SELECT album_id, artist_id, "album id is" || album_id col1, "artist id is" || artist_id col2, album_id || artist_id col3
    FROM album LIMIT 3

In [ ]:
%%sql
SELECT e1.first_name || " " || e1.last_name AS employee_name, e1.title AS employee_title, 
       e2.first_name || " " || e2.last_name AS supervisor_name, e2.title AS supervisor_title
    FROM employee e1
    LEFT JOIN employee e2 ON e1.reports_to = e2.employee_id
    ORDER BY employee_name
    LIMIT 5

In [ ]:
%%sql
SELECT first_name, last_name, phone
    FROM customer
    WHERE first_name LIKE "%Belle%"

In [ ]:
%%sql
SELECT media_type_id, name,
        CASE 
            WHEN name LIKE "%Protected%" THEN 1
            ELSE 0
            END
            AS Protected
    FROM media_type

In [ ]:
%%sql
SELECT c.first_name||" "||c.last_name AS customer_name, COUNT(*) AS number_of_purchases, SUM(i.total) AS total_spent,
     CASE 
        WHEN SUM(i.total) < 40 THEN "small spender"
        WHEN SUM(i.total) <= 100 THEN "regular"
        ELSE "big spender"
        END
        AS customer_category
    FROM customer c
    INNER JOIN invoice i ON i.customer_id = c.customer_id
    GROUP BY 1
    ORDER BY 1